Ran Apply for project: `github` dir: `apps/github` workspace: `github`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform apply -input=false -no-color \\-\\a\\u\\t\\o\\-\\a\\p\\p\\r\\o\\v\\e" in "/atlantis-data/repos/mvaldes14/terraform/53/github/apps/github": exit status 1
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/mvaldes/github/runs/run-yY6wNQRJoAGDYkjN

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
data.github_repository.blog: Refreshing...
github_repository.repo["todoist.nvim"]: Refreshing state... [id=todoist.nvim]
github_repository.repo["deckmaster-config"]: Refreshing state... [id=deckmaster-config]
github_repository.repo["pulumi"]: Refreshing state... [id=pulumi]
github_repository.repo["k8s-apps"]: Refreshing state... [id=k8s-apps]
github_repository.repo["twitch-bot"]: Refreshing state... [id=twitch-bot]
github_repository.repo["ansible_playbooks"]: Refreshing state... [id=ansible_playbooks]
github_repository.repo["scripts"]: Refreshing state... [id=scripts]
github_repository.repo["dotfiles-nix"]: Refreshing state... [id=dotfiles-nix]
github_repository.repo["meal-notifier"]: Refreshing state... [id=meal-notifier]
github_actions_secret.dockerhub_token["twitch-bot"]: Refreshing state... [id=twitch-bot:DOCKERHUB_TOKEN]
github_repository.repo["dotfiles"]: Refreshing state... [id=dotfiles]
github_actions_secret.dockerhub_token["meal-notifier"]: Refreshing state... [id=meal-notifier:DOCKERHUB_TOKEN]
github_repository.repo["chef"]: Refreshing state... [id=chef]
github_repository.repo["linear.nvim"]: Refreshing state... [id=linear.nvim]
github_actions_secret.dockerhub_username["twitch-bot"]: Refreshing state... [id=twitch-bot:DOCKERHUB_USERNAME]
github_actions_secret.dockerhub_username["meal-notifier"]: Refreshing state... [id=meal-notifier:DOCKERHUB_USERNAME]
github_repository_webhook.wh["pulumi"]: Refreshing state... [id=521145026]
github_repository_webhook.wh["chef"]: Refreshing state... [id=521145056]
github_repository_webhook.wh["todoist.nvim"]: Refreshing state... [id=521309558]
github_repository_webhook.wh["scripts"]: Refreshing state... [id=547034560]
data.github_repository.blog: Refresh complete after 2s [id=blog]
github_repository_webhook.wh["meal-notifier"]: Refreshing state... [id=521145050]
github_repository_webhook.wh["k8s-apps"]: Refreshing state... [id=521145049]
github_repository_webhook.wh["ansible_playbooks"]: Refreshing state... [id=521145032]
github_repository_webhook.wh["linear.nvim"]: Refreshing state... [id=521145043]
github_repository_webhook.wh["twitch-bot"]: Refreshing state... [id=521145035]
github_repository_webhook.wh["dotfiles-nix"]: Refreshing state... [id=521145046]
github_repository_webhook.wh["deckmaster-config"]: Refreshing state... [id=521145053]
github_repository_webhook.wh["dotfiles"]: Refreshing state... [id=521145038]
github_actions_secret.telegram_chat["twitch-bot"]: Refreshing state... [id=twitch-bot:TELEGRAM_TOKEN]
github_actions_secret.telegram_chat["meal-notifier"]: Refreshing state... [id=meal-notifier:TELEGRAM_TOKEN]
github_actions_secret.telegram_to["twitch-bot"]: Refreshing state... [id=twitch-bot:TELEGRAM_TO]
github_actions_secret.telegram_to["meal-notifier"]: Refreshing state... [id=meal-notifier:TELEGRAM_TO]
github_actions_secret.blog_docker_token: Refreshing state... [id=blog:DOCKERHUB_TOKEN]
github_actions_secret.blog_docker_secret: Refreshing state... [id=blog:DOCKERHUB_USERNAME]
github_repository.repo["scripts"]: Drift detected (update)
github_repository.repo["k8s-apps"]: Drift detected (update)
github_repository.repo["dotfiles"]: Drift detected (update)
github_repository.repo["dotfiles-nix"]: Drift detected (update)
github_repository.repo["meal-notifier"]: Drift detected (update)
github_repository.repo["ansible_playbooks"]: Drift detected (update)
github_repository.repo["twitch-bot"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_repository.repo["gh-actions"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + license_template            = "MIT"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "gh-actions"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "automation",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false
    }

  # github_repository.repo["scripts"] will be destroyed
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"dc8737af0096703bd864efdffe7b552d041511b8bb9f391985fba41fc7e9a665\"" -> null
      - full_name                   = "mvaldes14/scripts" -> null
      - git_clone_url               = "git://github.com/mvaldes14/scripts.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/mvaldes14/scripts" -> null
      - http_clone_url              = "https://github.com/mvaldes14/scripts.git" -> null
      - id                          = "scripts" -> null
      - is_template                 = false -> null
      - license_template            = "MIT" -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "scripts" -> null
      - node_id                     = "R_kgDOOrxPSQ" -> null
      - primary_language            = "Python" -> null
      - private                     = false -> null
      - repo_id                     = 985419593 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:mvaldes14/scripts.git" -> null
      - svn_url                     = "https://github.com/mvaldes14/scripts" -> null
      - topics                      = [
          - "homelab",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {
          - secret_scanning {
              - status = "enabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "enabled" -> null
            }
        }
    }

  # github_repository_webhook.wh["gh-actions"] will be created
  + resource "github_repository_webhook" "wh" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "*",
        ]
      + id         = (known after apply)
      + repository = "gh-actions"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.wh["scripts"] will be destroyed
  - resource "github_repository_webhook" "wh" {
      - active     = true -> null
      - events     = [
          - "*",
        ] -> null
      - id         = "547034560" -> null
      - repository = "scripts" -> null
      - url        = "https://api.github.com/repos/mvaldes14/scripts/hooks/547034560" -> null

      - configuration {
          - content_type = "json" -> null
          - insecure_ssl = false -> null
          - secret       = (sensitive value) -> null
          - url          = (sensitive value) -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

github_repository_webhook.wh["scripts"]: Destroying... [id=547034560]
github_repository.repo["scripts"]: Destroying... [id=scripts]
github_repository_webhook.wh["gh-actions"]: Creating...
github_repository.repo["gh-actions"]: Creating...
github_repository_webhook.wh["scripts"]: Destruction complete after 1s
github_repository.repo["scripts"]: Destruction complete after 2s
github_repository.repo["gh-actions"]: Still creating... [10s elapsed]
github_repository.repo["gh-actions"]: Creation complete after 13s [id=gh-actions]
╷
│ Error: POST https://api.github.com/repos/mvaldes14/gh-actions/hooks: 404 Not Found []
│
│   with github_repository_webhook.wh["gh-actions"],
│   on main.tf line 51, in resource "github_repository_webhook" "wh":
│   51: resource "github_repository_webhook" "wh" {
│
╵
Operation failed: failed running terraform apply (exit 1)
```
</details>